#==============================================================================
# ■ 物品选择处理扩张
#  作者：影月千秋
#------------------------------------------------------------------------------
# ● 简介
#  使事件中物品选择处理允许选择武器、防具、普通物品
#------------------------------------------------------------------------------
# ● 使用方法
#  安装此脚本后，在事件中物品选择处理之前加上一句脚本：
#    mca_change(symbol)
#  其中symbol是【:item】【:armor】【:weapon】之一，分别对应物品、防具、武器
#  这样的话，这一个物品选择处理就会处理对应项目
#  但是注意！！该脚本的作用域只有一个物品选择处理
#  如果连续使用两个物品选择处理，第一个会是对应项目，第二个则会是关键物品
#------------------------------------------------------------------------------
# ● 声明
#   本脚本来自【影月千秋】，使用、修改和转载请保留此信息
#==============================================================================
module MoVar;@ckiaddition = :key_item;end
class Game_Interpreter;def mca_change(symbol)
  MoVar.instance_variable_set("@ckiaddition", symbol)
end;end
class Window_KeyItem
  def enable?(item);true;end
  def category=(category)
    @category = MoVar.instance_variable_get("@ckiaddition") rescue category
    MoVar.instance_variable_set("@ckiaddition", category)
    refresh
    self.oy = 0
  end
end
#==============================================================================#
#=====                        =================================================#
           "■ 脚 本 尾"
#=====                        =================================================#
#==============================================================================#
