#==============================================================================
# ** 禁止在指定位置存档
#  作者：影月千秋
#------------------------------------------------------------------------------
# * 简介
#   禁止在指定档位上存档
#------------------------------------------------------------------------------
# * 使用方法
#  插入到其他脚本以下、Main之前，进行相关设定
#  事件中可使用add_no_save和remove_no_save来新增/取消被禁用的存档号
#  例【add_no_save(3,7,13)】【remove_no_save(4,2,7)】
#      禁止存在3号7号和13号   可以存在4号2号和7号了
#------------------------------------------------------------------------------
# * 声明
#   本脚本来自"影月千秋", 使用/修改/转载请保留此信息
#==============================================================================
module NoSave
  @N = [0]
    # 这是一个数组 在其中写禁止存档的存档号
      # 以下是正确的填写示例
      #  N = [0,1,2]
      #  N = [5]
      #  N = [3,11,14]
      # 示例结束
end # 请就此止步，不要更改其他地方


class Game_Interpreter;def add_no_save(*id);NoSave.instance_exec{@N.push(*id).u\
niq)};end;def remove_no_save(*id);NoSave.instance_exec{@N.delete_if{|x| id.incl\
ude? x}};end;end;class Scene_Save;def on_savefile_ok;super;if !NoSave.instance_\
exec{@N}.include?(@index) && DataManager.save_game(@index);on_save_success;else;
Sound.play_buzzer;end;end;end
#==============================================================================#
#=====                        =================================================#
            "脚 本 尾"
#=====                        =================================================#
#==============================================================================#